# BuiltInFailures.SharedCoordinatesFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SharedCoordinatesFailures Class
BuiltInFailures Class Members See Also
---
Failures about shared coordinates.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SharedCoordinatesFailures
```

Visual Basic
---
```text
Public NotInheritable Class SharedCoordinatesFailures
```

Visual C++
---
```text
public ref class SharedCoordinatesFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SharedCoordinatesFailures
# See Also
BuiltInFailures..::..SharedCoordinatesFailures Members
Autodesk.Revit.DB Namespace